"{\"scenarios\":[{\"industry\":\"Healthcare\",\"scenario_name\":\"Healthcare Spending vs Patient Satisfaction\",\"scenario_description\":\"This scenario involves creating a chart to analyze the correlation between healthcare spending and patient satisfaction scores across various facilities. Data sources include national expenditure records, patient satisfaction surveys, and hospital ratings. Columns needed consist of healthcare spending (in USD), patient satisfaction scores, and facility identification. The aggregation level will be at the hospital level, allowing us to compare spending versus outcomes. Visualization will highlight trends and correlations to identify if higher spending results in better patient satisfaction or if other factors contribute significantly.\"},{\"industry\":\"Healthcare\",\"scenario_name\":\"Staff Efficiency and Patient Throughput\",\"scenario_description\":\"Charts in this scenario aim to present the relationship between staff efficiency metrics (such as patient-handling time, number of patients per staff member) and patient throughput (admissions, discharges, average patient wait times). Data will be sourced from internal hospital records, HR databases, and operational logs. The primary columns required include staff ID, hours worked, number of patients handled, and throughput metrics. Aggregation will be monthly per department, enabling facility managers to identify resource allocation effectiveness and explore areas for process improvement.\"},{\"industry\":\"Healthcare\",\"scenario_name\":\"Drug Utilization Patterns and Compliance\",\"scenario_description\":\"This scenario requires a visualization to explore patterns in drug utilization and compliance rates from pharmacy records across healthcare institutions. Key columns include drug name, quantity dispensed, patient compliance rates, and potential adverse effects incidence. Data sources are electronic medical records (EMRs), pharmacy datasets, and compliance monitoring systems. Aggregation may be by drug category or time (monthly/quarterly), offering insights into prescribing trends, compliance levels, and resulting health outcomes to improve drug administration protocols or education programs.\"},{\"industry\":\"Healthcare\",\"scenario_name\":\"Telemedicine Adoption and Patient Reach\",\"scenario_description\":\"In this scenario, the focus is on providing charts that show the growth and reach of telemedicine services. Important data columns include number of telemedicine consultations, geographic location of patients, demographic details (age, gender), and follow-up visit rates. Sources include telemedicine service logs, patient registration systems, and demographic databases. Aggregation would be at the regional level or by provider group, showcasing adoption rates, accessibility improvements, and identifying regions needing increased telemedicine infrastructure or outreach efforts.\"}]}"