"{\"scenarios\":[{\"industry\":\"Manufacturing\",\"scenario_name\":\"Factory Performance Monitoring\",\"scenario_description\":\"This dashboard focuses on monitoring and comparing the performance of different factories within a manufacturing company. The primary columns needed include factory location, production volume, operational hours, downtime, and efficiency metrics. The data should be sourced from factory management systems and IoT devices installed on machinery for real-time analytics. The report will aggregate data daily to identify trends, seasonal variations, and areas for improvement. Visuals like heatmaps and line charts will help in identifying factories that are lagging behind in performance, need maintenance, or are excelling in output. This will provide insights into resource allocation and investment strategies.\"},{\"industry\":\"Manufacturing\",\"scenario_name\":\"Predictive Maintenance\",\"scenario_description\":\"This scenario involves using data analytics to predict when manufacturing equipment is likely to fail or require maintenance. Data columns include equipment ID, last maintenance date, hours of operation, and operational temperature records. The data primarily comes from sensors on machines and maintenance logs. Aggregation takes place weekly to spot patterns suggesting imminent failures. Visualizations like trend lines and bar graphs on the dashboard will showcase potential problem areas and help in scheduling maintenance proactively, thus reducing unplanned downtime and improving asset longevity.\"},{\"industry\":\"Manufacturing\",\"scenario_name\":\"Quality Control Statistics\",\"scenario_description\":\"A dashboard providing insights into product quality control within the manufacturing process. Critical columns include defect rate, type of defect, production line, batch number, and operator. Data sources are quality inspection reports and production databases. The report needs daily aggregation to swiftly respond to quality issues. Charts like histograms and Pareto charts will help identify recurring defects and high-risk production lines. This enables the quality control team to focus on problem areas and implement corrective actions efficiently, ensuring consistent product quality.\"},{\"industry\":\"Manufacturing\",\"scenario_name\":\"Energy Consumption Analysis\",\"scenario_description\":\"An analysis dashboard that tracks energy consumption across different stages of the manufacturing process. Necessary columns comprise machine ID, energy consumption rate, time of usage, and production output. Data is sourced from energy meters installed on equipment and manufacturing schedules. Daily aggregation allows pinpointing energy-intensive processes and machines. The dashboard will feature line graphs and stack bar charts to compare energy usage over time and across locations. Insights will guide strategies to reduce energy costs, implement greener practices, and optimize machine usage.\"},{\"industry\":\"Manufacturing\",\"scenario_name\":\"Employee Productivity Metrics\",\"scenario_description\":\"A dedicated dashboard for assessing employee productivity and the impact of workforce management practices. Relevant columns are employee ID, shift timing, task completion rate, and overtime hours. Data is gathered from human resource management systems and time-tracking tools. Weekly aggregation helps in understanding workforce dynamics and productivity fluctuations. Utilizing scatter plots and performance trend graphs, this dashboard informs management about high-performing teams or shifts and areas requiring training or workforce adjustments, aiding in operational efficiency.\"}]}"