{
    "industries": [
      {
        "industry": "Government",
        "scenario": {
          "name": "Public Budget Allocation Dashboard",
          "description": "An interactive visualization displaying government budget allocation and spending across various departments (e.g., healthcare, education, defense). It includes year-over-year changes, underfunded sectors, and citizen satisfaction insights."
        }
      },
      {
        "industry": "Healthcare",
        "scenario": {
          "name": "Patient Outcome Trends by Disease",
          "description": "A visualization tracking patient outcomes (recovery rates, readmission rates, mortality rates) over time for specific diseases across hospitals. Includes demographic filters (age, gender) and treatment method comparisons."
        }
      },
      {
        "industry": "Financial Services",
        "scenario": {
          "name": "Fraud Detection Heatmap",
          "description": "A live heatmap visualizing flagged transactions for potential fraud. Segments include geography, transaction size, and time, with drill-down capabilities to analyze fraud patterns."
        }
      },
      {
        "industry": "Manufacturing",
        "scenario": {
          "name": "Supply Chain Bottleneck Analysis",
          "description": "A dashboard showing the flow of raw materials and finished goods through the supply chain, highlighting delays, inefficiencies, and potential risks in real-time."
        }
      },
      {
        "industry": "Defence",
        "scenario": {
          "name": "Mission Readiness Overview",
          "description": "A data visualization of troop and equipment readiness levels, training completion rates, and mission availability. Includes regional filters and risk analysis for resource allocation."
        }
      },
      {
        "industry": "Information Technology",
        "scenario": {
          "name": "IT Infrastructure Health Monitor",
          "description": "A dashboard monitoring servers, networks, and application performance metrics. Includes alerts for anomalies, historical trends, and predictive analysis for potential failures."
        }
      },
      {
        "industry": "Education",
        "scenario": {
          "name": "Student Performance Analytics",
          "description": "An interactive tool tracking student performance metrics across subjects, attendance, and engagement. Enables comparison by demographics, schools, or regions and identifies trends or gaps."
        }
      },
      {
        "industry": "Automobile",
        "scenario": {
          "name": "Vehicle Performance Insights",
          "description": "A visualization showing real-time and historical performance data of vehicles, including fuel efficiency, maintenance alerts, and driving habits. Offers fleet-wide analytics for businesses."
        }
      },
      {
        "industry": "Hospitality",
        "scenario": {
          "name": "Customer Satisfaction Dashboard",
          "description": "A dashboard visualizing guest satisfaction scores, feedback trends, and service efficiency. Filters by location, service type, and time period to improve customer experiences."
        }
      },
      {
        "industry": "Construction",
        "scenario": {
          "name": "Project Progress Tracker",
          "description": "A visualization tracking construction project progress against timelines and budgets. Highlights delays, resource utilization, and safety incident reports in real-time."
        }
      }
    ]
  }